group-reports/sharif/results/10G-disk-throughput-tuning-protocol-A-sndbuf-2k/test-2.txt
write-sequentially-test-job: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
write-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

write-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=103023: Fri Jul 14 09:44:44 2023
  write: IOPS=3, BW=13.4MiB/s (14.1MB/s)(8144MiB/605910msec)
    slat (usec): min=24, max=427, avg=146.31, stdev=56.57
    clat (msec): min=216, max=10992, avg=4757.53, stdev=1267.12
     lat (msec): min=217, max=10992, avg=4757.68, stdev=1267.12
    clat percentiles (msec):
     |  1.00th=[ 1804],  5.00th=[ 2735], 10.00th=[ 3239], 20.00th=[ 3708],
     | 30.00th=[ 4077], 40.00th=[ 4463], 50.00th=[ 4732], 60.00th=[ 5067],
     | 70.00th=[ 5403], 80.00th=[ 5738], 90.00th=[ 6342], 95.00th=[ 6812],
     | 99.00th=[ 7752], 99.50th=[ 8288], 99.90th=[ 9329], 99.95th=[10134],
     | 99.99th=[10939]
   bw (  KiB/s): min= 8175, max=90112, per=100.00%, avg=16213.40, stdev=10052.83, samples=1021
   iops        : min=    1, max=   22, avg= 3.89, stdev= 2.47, samples=1021
  lat (msec)   : 250=0.05%, 500=0.05%, 750=0.25%, 1000=0.20%
  cpu          : usr=0.33%, sys=0.05%, ctx=2029, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=99.3%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2036,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=13.4MiB/s (14.1MB/s), 13.4MiB/s-13.4MiB/s (14.1MB/s-14.1MB/s), io=8144MiB (8540MB), run=605910-605910msec

Disk stats (read/write):
    drbd1: ios=0/16443, merge=0/0, ticks=0/75656243, in_queue=75656243, util=99.71%, aggrios=0/18466, aggrmerge=0/0, aggrticks=0/274869, aggrin_queue=274869, aggrutil=6.62%
    dm-0: ios=0/18466, merge=0/0, ticks=0/274869, in_queue=274869, util=6.62%, aggrios=0/18463, aggrmerge=0/3, aggrticks=0/275067, aggrin_queue=265848, aggrutil=6.62%
  sde: ios=0/18463, merge=0/3, ticks=0/275067, in_queue=265848, util=6.62%